import { StyledContents } from "./style";

const Home = () => (
  <div>
    <StyledContents>
      <div className="contents-container">
        <h1 className="page-title">메인</h1>
        <p className="page-content">
          부용고등학교 2학년 2반 학생들로서 학교에 다니는 재학생이나 부용고에 입학하고 싶어 하는 예비 고1 학생들을 위해 블로그를 만들었어요. 부용고 학생들에게 도움이 될 만한 일이 무엇일까 고민하다가, 학급 특색 활동 시간을 이용해 부용고 사용 설명서를 만들기로 결정했어요. 그럼으로써 학교에 대한 자신의 생각을 고찰하고, 교내의 다양한 활동 중 어떤 내용을 소개할지 선택했어요.

          그래서 이 블로그에는 부용고등학교를 다니는 선배로서 후배들에게 해주고 싶은 조언, 직접 경험하지 못한 부서를 간접적으로 느낄 수 있는 소개, 학교에 적용되는 교칙과 시설, 그리고 이로 인한 개인적인 경험 등 부용고 학생만이 알 수 있거나 알아야 하는 내용들이 가득 담겨 있어요.

          학생들이 직접 만드는 활동이기 때문에 부족한 부분도 많이 있어요. 하지만 이 활동에 대한 애정을 가지고 열심히 진행해왔다는 점은 분명해요. 그래서 부족한 부분에 대해 너무 신경 쓰지 말고, 그저 참고하는 정도로 즐겨주셨으면 좋겠어요.
            
          <br />
          <br />

          학교 시설이나 학교 활동에 대해 잘 모르고 있는 학생, 학교생활을 잘하고 있는지 의문이 드는 학생, 생기부 작성에 어려움을 겪고 있는 학생, 또는 부용고에 입학을 고민하고 있는 학생이라면 이 블로그를 읽어보세요. 분명 당신에게 도움이 될 거예요.
        </p>
      </div>
    </StyledContents>
  </div>
);

export default Home;